app/helpers/sessions_helper.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id])

SELECT `organizations`.`id` FROM `organizations` INNER JOIN `organization_users` ON `organizations`.`id` = `organization_users`.`organization_id` WHERE `organization_users`.`user_id` = 1
---
  def current_organization
    @current_organization ||= Organization.find_by(id: current_user.organizations.ids)