app/controllers/api/v1/linkages_controller.rb

INSERT INTO `linkages` (`name`, `token`, `organization_id`, `created_at`, `updated_at`) VALUES ('test', 'testtoken', 1, '2022-02-19 13:17:23.366074', '2022-02-19 13:17:23.366074')
---
  def create
    token = current_organization.linkages.new(linkage_params)
    if token.save