app/controllers/api/v1/registrations_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('test', 'test@gmail.com', '$2a$12$5o.q6od6A1kCXMQS9rI2K.7lfwQF8IFd4pgEkMDTfONRaHEfUfANW', '2022-02-19 13:03:09.327687', '2022-02-19 13:03:09.327687')
---
  def signup
    user = User.new(registrations_params)

    if user.save